                        Aula 2: Preparação e limpeza dos dados

Import do arquivo que contém a função que carrega e renomeia a nossa 
base de dados

In [1]:
import funcoes

Chamada da função carregar_dados do arquivo funcoes.py

In [2]:
base_de_dados = funcoes.carregar_dados()

Visualizando a base de dados com o head para verificar se a utilização da função funcionou

In [3]:
base_de_dados.head()

,ano,senioridade,Contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Sênior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio Porte
1,2025.0,Sênior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio Porte
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio Porte
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio Porte
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Médio Porte

Funções que tem como objetivo mostrar a quantidade de linhas (valores) nulos

-> isnull: Mostra na base de dados as linhas que contém os valores nulos

-> sum: Mostra o total de de linhas (valores) nulos

In [4]:
base_de_dados.isnull().sum()

ano                10
senioridade         0
Contrato            0
cargo               0
salario             0
moeda               0
usd                 0
residencia          0
remoto              0
empresa             0
tamanho_empresa     0
dtype: int64

O unique tem como objetivo mostrar os valores únicos de uma coluna

In [5]:
base_de_dados['ano'].unique()

array([2025.,   nan, 2024., 2022., 2023., 2020., 2021.])

O isnull irá sinalizar as linhas que possuem valores nulos onde:

-> True: Linha que possui valores nulos

-> False: Linhas que não possuem valores nulos

In [6]:
base_de_dados['ano'].isnull()

0         False
1         False
2         False
3         False
4         False
          ...
133344    False
133345    False
133346    False
133347    False
133348    False
Name: ano, Length: 133349, dtype: bool

Agora vamos ver algumas técnicas para lidar com valores nulos no dataset.
Para isso, iremos criar novos dataframes para aplicar essas técnicas

In [ ]:
# Biblioteca que nos permite carregar datasets, manipular dados
# e criar dataframes
import pandas as pd

# Biblioteca que possibilita a manipulação de arrays e nos dara 
# acesso a valores nulos que iremos inserir nos nossos dataframes
# de exemplo
import numpy as np

# Criação de um dataframe que irá conter 2 colunas: nome e salário.
# Vamos usar a função DataFrame do pandas que irá receber como
# argumento um dicionário que irá conter uma lista de valores, onde
# o rótulo representa o nome da coluna e a lista os valores 
dataframe_salarios = pd.DataFrame({
                                   
                                   'nome': ["Ana", "Bruno", "Carlos","Daniele", "val"],
                                   
                                   # Os np.nan inserem dados nulos no dataframe
                                   "salario":[4000, np.nan, 5000, np.nan, 100000]
                                   
                                   })
# Agora vamos utilizar a função mean do pandas que irá preencher
# os dados faltantes com a média dos valores da coluna.
# dataframe_salarios['salario_media']: ira criar uma nova coluna no
# dataframe (que irá receber os valores da média dos salários).
# fillna: Função do pandas que tem como objetivo preencher dados
# faltantes com um valor padrão. Nesse caso ele vai receber as medias
# da coluna salário
# round: Irá limitar a quantidade de valores após a virgula
dataframe_salarios['salario_media'] = dataframe_salarios['salario'].fillna(dataframe_salarios["salario"].mean().round(2))

Visualizando o dataframe

In [8]:
dataframe_salarios

      nome   salario  salario_media
0      Ana    4000.0        4000.00
1    Bruno       NaN       36333.33
2   Carlos    5000.0        5000.00
3  Daniele       NaN       36333.33
4      val  100000.0      100000.00

-> Vamos agora usar a mesma lógica do código anterior, porém iremos preencher os dados usando a mediana

-> Mediana: Valor que divide os dados de uma coluna em 50%

In [9]:
dataframe_salarios['salario_mediana'] = dataframe_salarios['salario'].fillna(dataframe_salarios['salario'].median().round(2))

Visualizando o dataframe

In [10]:
dataframe_salarios

      nome   salario  salario_media  salario_mediana
0      Ana    4000.0        4000.00           4000.0
1    Bruno       NaN       36333.33           5000.0
2   Carlos    5000.0        5000.00           5000.0
3  Daniele       NaN       36333.33           5000.0
4      val  100000.0      100000.00         100000.0

Criando um dataframe com as colunas dia_semana e temperatura. Nesse 
dataframe iremos preencher os dados faltanres usando o ffill.

ffill: Função que tem como objetivo preencher os dados faltantes
usando o valor da linha ácima

In [11]:
dataframe_temperatura = pd.DataFrame({
                    
                      'dia_semana': ["Segunda", "Terça", "Quarta", "Quinta", "Sexta"],
    
                       'temperatura': [30, np.nan, np.nan, 28, 27]
})

dataframe_temperatura['preenchido_ffill'] = dataframe_temperatura['temperatura'].ffill()

dataframe_temperatura

  dia_semana  temperatura  preenchido_ffill
0    Segunda         30.0              30.0
1      Terça          NaN              30.0
2     Quarta          NaN              30.0
3     Quinta         28.0              28.0
4      Sexta         27.0              27.0

Agora vamos preencher os dados usando a função bfill.

-> bfill: Tem como objetivo preencher os dados faltantes com o valor
da linha abaixo

In [12]:
dataframe_temperatura['preenchido_bfill'] = dataframe_temperatura['temperatura'].bfill()

dataframe_temperatura

  dia_semana  temperatura  preenchido_ffill  preenchido_bfill
0    Segunda         30.0              30.0              30.0
1      Terça          NaN              30.0              28.0
2     Quarta          NaN              30.0              28.0
3     Quinta         28.0              28.0              28.0
4      Sexta         27.0              27.0              27.0

preenchendo os dados utilizando o fillna.

-> fillna: Como vimos anteriormente, é a função recebe como argumento
um valor padrão para dados faltantes

In [13]:
dataframe_cidades = pd.DataFrame({
    
    'nome':["Ana", "Bruno", "Carlos", "Daniele", "val"],
    
    'cidades':["São Paulo", np.nan, "Curitiba", np.nan, "Belem", ]
    
})

dataframe_cidades['cidade_preenchida'] = dataframe_cidades['cidades'].fillna("Cidade não informada")

dataframe_cidades

      nome    cidades     cidade_preenchida
0      Ana  São Paulo             São Paulo
1    Bruno        NaN  Cidade não informada
2   Carlos   Curitiba              Curitiba
3  Daniele        NaN  Cidade não informada
4      val      Belem                 Belem

agora vamos eliminar os dados nulos da nossa base de dados

dropna: Função que tem como objetivo eliminar valores nulos

In [ ]:
# Irám receber a base de dados sem os valores nulos
base_de_dados_limpa = base_de_dados.dropna()

Visualizando se a exclusão dos dados nulos funcionou

In [15]:
base_de_dados_limpa.isnull().sum()

ano                0
senioridade        0
Contrato           0
cargo              0
salario            0
moeda              0
usd                0
residencia         0
remoto             0
empresa            0
tamanho_empresa    0
dtype: int64

Visualizanodo a base de dados sem os valores nulos

In [16]:
base_de_dados_limpa.head()

,ano,senioridade,Contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Sênior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio Porte
1,2025.0,Sênior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio Porte
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio Porte
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio Porte
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Médio Porte

Como podemos observar na tabela e na função info, a coluna de ano está como tipo float, que não é o tipo ideal para representar uma coluna de anos.

In [17]:
base_de_dados_limpa.info()

<class 'pandas.core.frame.DataFrame'>
Index: 133339 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   ano              133339 non-null  float64
 1   senioridade      133339 non-null  object
 2   Contrato         133339 non-null  object
 3   cargo            133339 non-null  object
 4   salario          133339 non-null  int64
 5   moeda            133339 non-null  object
 6   usd              133339 non-null  int64
 7   residencia       133339 non-null  object
 8   remoto           133339 non-null  object
 9   empresa          133339 non-null  object
 10  tamanho_empresa  133339 non-null  object
dtypes: float64(1), int64(2), object(8)
memory usage: 12.2+ MB

-> Como vimos anteriormente, será necessário converter a coluna ano de 
float para int (valor adequado para a coluna)

-> Assign: O assign é um método do Pandas que cria uma nova co9luna ou
sobrescreve uma coluna existente. No nosso caso, iremos sobrescrever
a coluna de ano com os valores convertidos para int. A função recebe
como argumento:  a coluna que será modificada e o valor que será 
inserido

-> astype: Função que tem como objetivo converter a tipagem dos dados.
Ela recebe como argumento o tipo que você quer transformar os dados.

In [18]:
base_de_dados_limpa = base_de_dados_limpa.assign(ano = base_de_dados_limpa['ano'].astype(int))

Visualizando se a conversão de tipo funcionou

In [19]:
base_de_dados_limpa.info()

<class 'pandas.core.frame.DataFrame'>
Index: 133339 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   ano              133339 non-null  int64
 1   senioridade      133339 non-null  object
 2   Contrato         133339 non-null  object
 3   cargo            133339 non-null  object
 4   salario          133339 non-null  int64
 5   moeda            133339 non-null  object
 6   usd              133339 non-null  int64
 7   residencia       133339 non-null  object
 8   remoto           133339 non-null  object
 9   empresa          133339 non-null  object
 10  tamanho_empresa  133339 non-null  object
dtypes: int64(3), object(8)
memory usage: 12.2+ MB

Visualizando a tabela com os dados do ano em formato int

In [20]:
base_de_dados_limpa.head()

,ano,senioridade,Contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025,Sênior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio Porte
1,2025,Sênior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio Porte
2,2025,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio Porte
3,2025,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio Porte
4,2025,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Médio Porte